reddit_clone/reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("sub_id", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?)  [["sub_id", 1], ["created_at", "2018-11-21 00:20:18.684809"], ["updated_at", "2018-11-21 00:20:18.684809"], ["post_id", 6]]
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.sub_id = params[:sub_id]

    if @post.save