reddit_clone/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "App Academy"], ["description", "A04 is coming soon"], ["user_id", 2], ["created_at", "2018-11-20 22:59:26.418868"], ["updated_at", "2018-11-20 22:59:26.418868"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = ?, "updated_at" = ? WHERE "subs"."id" = ?  [["description", "A04 is coming soon\r\nJon needs sleep"], ["updated_at", "2018-11-20 23:01:06.802971"], ["id", 1]]
---
  def update
    @sub = current_user.subs.find(params[:id])
    # Test for empty sub
    if @sub.update_attributes(sub_params)